{"backend": "tensorflow", "keras_version": "2.3.1", "config": {"name": "model_1", "output_layers": [["decoder_dense", 0, 0]], "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]], "layers": [{"name": "encoder_inputs", "config": {"name": "encoder_inputs", "batch_input_shape": [null, null], "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "encoder_embedding", "config": {"embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "input_length": 13, "input_dim": 1368, "batch_input_shape": [null, 13], "activity_regularizer": null, "name": "encoder_embedding", "embeddings_regularizer": null, "trainable": true, "dtype": "float32", "mask_zero": false, "output_dim": 256, "embeddings_constraint": null}, "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "decoder_inputs", "config": {"name": "decoder_inputs", "batch_input_shape": [null, null, 1623], "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "encoder_lstm", "config": {"kernel_constraint": null, "units": 256, "use_bias": true, "bias_constraint": null, "unit_forget_bias": true, "recurrent_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "encoder_lstm", "trainable": true, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_activation": "sigmoid", "go_backwards": false, "recurrent_regularizer": null, "return_sequences": false, "return_state": true, "stateful": false, "dtype": "float32", "implementation": 2, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["encoder_embedding", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "decoder_lstm", "config": {"kernel_constraint": null, "units": 256, "use_bias": true, "bias_constraint": null, "unit_forget_bias": true, "recurrent_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "decoder_lstm", "trainable": true, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "dropout": 0.0, "recurrent_dropout": 0.0, "recurrent_activation": "sigmoid", "go_backwards": false, "recurrent_regularizer": null, "return_sequences": true, "return_state": true, "stateful": false, "dtype": "float32", "implementation": 2, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]], "class_name": "LSTM"}, {"name": "decoder_dense", "config": {"kernel_constraint": null, "units": 1623, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "decoder_dense", "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "softmax"}, "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]], "class_name": "Dense"}]}, "class_name": "Model"}