{"config": {"input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]], "layers": [{"config": {"sparse": false, "batch_input_shape": [null, null], "dtype": "float32", "name": "encoder_inputs"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "encoder_inputs"}, {"config": {"input_dim": 1656, "name": "encoder_embedding", "mask_zero": false, "batch_input_shape": [null, 24], "trainable": true, "embeddings_constraint": null, "activity_regularizer": null, "output_dim": 256, "input_length": 24, "dtype": "float32", "embeddings_regularizer": null, "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}}, "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]], "class_name": "Embedding", "name": "encoder_embedding"}, {"config": {"sparse": false, "batch_input_shape": [null, null, 1394], "dtype": "float32", "name": "decoder_inputs"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "decoder_inputs"}, {"config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "name": "encoder_lstm", "trainable": true, "unroll": false, "recurrent_regularizer": null, "recurrent_activation": "sigmoid", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "recurrent_constraint": null, "bias_regularizer": null, "dropout": 0.0, "stateful": false, "go_backwards": false, "units": 256, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "return_sequences": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "tanh", "implementation": 2, "return_state": true, "use_bias": true}, "inbound_nodes": [[["encoder_embedding", 0, 0, {}]]], "class_name": "LSTM", "name": "encoder_lstm"}, {"config": {"recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "name": "decoder_lstm", "trainable": true, "unroll": false, "recurrent_regularizer": null, "recurrent_activation": "sigmoid", "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "recurrent_constraint": null, "bias_regularizer": null, "dropout": 0.0, "stateful": false, "go_backwards": false, "units": 256, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "return_sequences": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "tanh", "implementation": 2, "return_state": true, "use_bias": true}, "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]], "class_name": "LSTM", "name": "decoder_lstm"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "name": "decoder_dense", "bias_regularizer": null, "use_bias": true, "units": 1394}, "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]], "class_name": "Dense", "name": "decoder_dense"}], "output_layers": [["decoder_dense", 0, 0]], "name": "model_1"}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.3.1"}